/*
 * tclets.r --
 *
 */

/*
 * New style DLOG templates have an extra field for the positioning
 * options for the Dialog Box.  We will not use this, for now, so we
 * turn it off here.
 */
 
#define DLOG_RezTemplateVersion 0

#include <Types.r>
#include <SysTypes.r>
#include <AEUserTermTypes.r>

/* 
 * We now load the Tclets code into the resource fork
 */

#define TK_LIBRARY_RESOURCES 3000

read 'TEXT' (TK_LIBRARY_RESOURCES+114, "tclshrc", purgeable) 
	"::mac:tclets.tcl";

data 'icns' (-16455) {
	$"6963 6E73 0000 08F8 6963 7323 0000 0048"            /* icns...Øics#...H */
	$"0100 02EE 05CE 09EE 13DE 23FF 47CE 86C6"            /* ...”.ëê”.ﬁ#ùGë‹ê */
	$"4681 22C2 12C4 0888 0410 0220 0140 0080"            /* F≈"¨.ü.‡... .@.ƒ */
	$"0100 03EE 07CE 0FEE 1FFE 3FFF 7FFE FFFE"            /* ...”.ë.”.ú?ù.úùú */
	$"7FFF 3FFE 1FFC 0FF8 07F0 03E0 01C0 0080"            /* .ù?ú.∏.Ø.ï.˝.ø.ƒ */
	$"6963 7334 0000 0088 0000 000F 0000 0000"            /* ics4...‡........ */
	$"0000 00FC F6D0 FFF0 0000 0FC5 DD00 F6F0"            /* ...∏ñ≠ùï...â.ñï */
	$"0000 FCCD 66F0 F6F0 000F CC6E 66CE F6F0"            /* ..∏’fïñï..√nfëñï */
	$"00FC CC6E 67EF F6FF 0FCC CD66 66CC F6F0"            /* .∏√ng‘ñù.√’ff√ñï */
	$"FCCC CDDC 66CC CFA0 0FCC CD6C EDCC CC0F"            /* ∏√’–f√¶›.√’lÃ√√. */
	$"00FC CC6C E6CC CCF0 000F CC6C 66CC CF00"            /* .∏√l √√ï..√lf√¶. */
	$"0000 FCCC 6CCC F000 0000 0FCC DCCF 0000"            /* ..∏√l√ï....√–¶.. */
	$"0000 00FD DCF0 0000 0000 000F CF00 0000"            /* ...õ–ï......¶... */
	$"0000 0000 F000 0000 6963 7338 0000 0108"            /* ....ï...ics8.... */
	$"0000 0000 0000 00FF 0000 0000 0000 0000"            /* .......ù........ */
	$"0000 0000 0000 FF2B FFEC 7F00 FFFF FF00"            /* ......ù+ùœ..ùùù. */
	$"0000 0000 00FF 2BB0 7F7F 0000 FFEC FF00"            /* .....ù+É....ùœù. */
	$"0000 0000 FF2B 2B7F ECEC FF00 FFEC FF00"            /* ....ù++.œœù.ùœù. */
	$"0000 00FF 2B2B ECFC ECEC 2BFB FFEC FF00"            /* ...ù++œ∏œœ+öùœù. */
	$"0000 FF2B 2B2B ECFC ECC0 FBFF FFEC FFFF"            /* ..ù+++œ∏œøöùùœùù */
	$"00FF 2B2B 2B7F ECEC ECEC 2B2B FFEC FF00"            /* .ù+++.œœœœ++ùœù. */
	$"FF2B 2B2B 2B7F 7FF6 ECEC 2B2B 2BFF FD00"            /* ù++++..ñœœ+++ùõ. */
	$"00FF 2B2B 2B7F ECF6 FCF9 2B2B 2B2B 00FF"            /* .ù+++.œñ∏ò++++.ù */
	$"0000 FF2B 2B2B ECF6 FCEC 2B2B 2B2B FF00"            /* ..ù+++œñ∏œ++++ù. */
	$"0000 00FF 2B2B ECF6 ECEC 2B2B 2BFF 0000"            /* ...ù++œñœœ+++ù.. */
	$"0000 0000 FF2B 2BF6 EC2B 2B2B FF00 0000"            /* ....ù++ñœ+++ù... */
	$"0000 0000 00FF 2BF6 F92B 2BFF 0000 0000"            /* .....ù+ñò++ù.... */
	$"0000 0000 0000 FFF9 F92B FF00 0000 0000"            /* ......ùòò+ù..... */
	$"0000 0000 0000 00FF 2BFF 0000 0000 0000"            /* .......ù+ù...... */
	$"0000 0000 0000 0000 FF00 0000 0000 0000"            /* ........ù....... */
	$"4943 4E23 0000 0108 0001 0000 0002 8000"            /* ICN#..........ƒ. */
	$"0004 78F8 0008 70F8 0010 F0F8 0021 E8F8"            /* ..xØ..pØ..ïØ.!ÀØ */
	$"0043 C4F8 0081 FAF8 0107 F1F8 0207 F0F8"            /* .CüØ.≈ôØ..“Ø..ïØ */
	$"0407 F7FF 0807 E3FE 1007 E1FC 200E E0F8"            /* ..óù..ìú..∑∏ .˝Ø */
	$"4002 E074 800E E022 400E E001 200E C002"            /* @.˝tƒ.˝"@.˝. .ø. */
	$"1006 E004 0806 C008 0406 E010 0202 C020"            /* ..˝...ø...˝...ø  */
	$"0102 C040 0080 8080 0040 0100 0020 0200"            /* ..ø@.ƒƒƒ.@... .. */
	$"0010 0400 0008 0800 0004 1000 0002 2000"            /* .............. . */
	$"0001 4000 0000 8000 0001 0000 0003 8000"            /* ..@...ƒ.......ƒ. */
	$"0007 F8F8 000F F0F8 001F F0F8 003F F8F8"            /* ..ØØ..ïØ..ïØ.?ØØ */
	$"007F FCF8 00FF FEF8 01FF FFF8 03FF FFF8"            /* ..∏Ø.ùúØ.ùùØ.ùùØ */
	$"07FF FFFF 0FFF FFFE 1FFF FFFC 3FFF FFF8"            /* .ùùù.ùùú.ùù∏?ùùØ */
	$"7FFF FFFC FFFF FFFE 7FFF FFFF 3FFF FFFE"            /* .ùù∏ùùùú.ùùù?ùùú */
	$"1FFF FFFC 0FFF FFF8 07FF FFF0 03FF FFE0"            /* .ùù∏.ùùØ.ùùï.ùù˝ */
	$"01FF FFC0 00FF FF80 007F FF00 003F FE00"            /* .ùùø.ùùƒ..ù..?ú. */
	$"001F FC00 000F F800 0007 F000 0003 E000"            /* ..∏...Ø...ï...˝. */
	$"0001 C000 0000 8000 6963 6C34 0000 0208"            /* ..ø...ƒ.icl4.... */
	$"0000 0000 0000 000F 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 00FC F000 0000 0000 0000"            /* .......∏ï....... */
	$"0000 0000 0000 0FCC CFD6 D000 FFFF F000"            /* .......√¶˜≠.ùùï. */
	$"0000 0000 0000 FCCC C556 0000 F767 F000"            /* ......∏√âV..ógï. */
	$"0000 0000 000F CCCC 566F 0000 F676 F000"            /* ......√√Vo..ñvï. */
	$"0000 0000 00FC CCC5 6F5C F000 F767 F000"            /* .....∏√âo\ï.ógï. */
	$"0000 0000 0FCC CC66 66CC 0F00 F676 F000"            /* .....√√ff√..ñvï. */
	$"0000 0000 FCCC CCD5 5666 FCF0 F767 F000"            /* ....∏√√πVf∏ïógï. */
	$"0000 000F CCCC C656 5667 CCCF F676 F000"            /* ....√√êVVg√¶ñvï. */
	$"0000 00FC CCCC C6E5 5566 CCCC F767 F000"            /* ...∏√√ê¬Uf√√ógï. */
	$"0000 0FCC CCCC C656 5657 CFFF F676 FFFF"            /* ...√√√êVVW¶ùñvùù */
	$"0000 FCCC CCCC C6E5 565C CCF7 6767 67F0"            /* ..∏√√√ê¬V\√ógggï */
	$"000F CCCC CCCC C655 565C CCCF 7676 7F00"            /* ..√√√√êUV\√¶vv.. */
	$"00FC CCCC CCCC 7660 556C CCCC F767 F000"            /* .∏√√√√v`Ul√√ógï. */
	$"0FCC CCCC CCCC CD5D 567C CCCC CF7F CF00"            /* .√√√√√’]V|√√¶.¶. */
	$"FCCC CCCC CCCC 6660 556C CCCC CCFC CCF0"            /* ∏√√√√√f`Ul√√√∏√ï */
	$"0FCC CCCC CCCC 665C 565C CCCC CCCC CCCF"            /* .√√√√√f\V\√√√√√¶ */
	$"00FC CCCC CCCC 6660 E6DC CCCC CCCC CCF0"            /* .∏√√√√f` –√√√√√ï */
	$"000F CCCC CCCC C650 656C CCCC CCCC CF00"            /* ..√√√√êPel√√√√¶. */
	$"0000 FCCC CCCC C6EC 5ECC CCCC CCCC F000"            /* ..∏√√√êœ^√√√√√ï. */
	$"0000 0FCC CCCC C650 566C CCCC CCCF 0000"            /* ...√√√êPVl√√√¶.. */
	$"0000 00FC CCCC CC50 D5CC CCCC CCF0 0000"            /* ...∏√√√Pπ√√√√ï.. */
	$"0000 000F CCCC CC50 56CC CCCC CF00 0000"            /* ....√√√PV√√√¶... */
	$"0000 0000 FCCC CCD0 5CCC CCCC F000 0000"            /* ....∏√√≠\√√√ï... */
	$"0000 0000 0FCC CCD0 DCCC CCCF 0000 0000"            /* .....√√≠–√√¶.... */
	$"0000 0000 00FC CCD0 DCCC CCF0 0000 0000"            /* .....∏√≠–√√ï.... */
	$"0000 0000 000F CCD0 DCCC CF00 0000 0000"            /* ......√≠–√¶..... */
	$"0000 0000 0000 FCC0 CCCC F000 0000 0000"            /* ......∏ø√√ï..... */
	$"0000 0000 0000 0FCD CCCF 0000 0000 0000"            /* .......’√¶...... */
	$"0000 0000 0000 00FC CCF0 0000 0000 0000"            /* .......∏√ï...... */
	$"0000 0000 0000 000F CF00 0000 0000 0000"            /* ........¶....... */
	$"0000 0000 0000 0000 F000 0000 0000 0000"            /* ........ï....... */
	$"6963 6C38 0000 0408 0000 0000 0000 0000"            /* icl8............ */
	$"0000 0000 0000 00FF 0000 0000 0000 0000"            /* .......ù........ */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 FF2B FF00 0000 0000 0000"            /* ......ù+ù....... */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 00FF 2B2B 2BFF 7FEC 7F00 0000"            /* .....ù+++ù.œ.... */
	$"FFFF FFFF FF00 0000 0000 0000 0000 0000"            /* ùùùùù........... */
	$"0000 0000 FF2B 2B2B 2BB0 B0EC 0000 0000"            /* ....ù++++ÉÉœ.... */
	$"FFC0 ECC0 FF00 0000 0000 0000 0000 0000"            /* ùøœøù........... */
	$"0000 00FF 2B2B 2B2B B0EC ECFF 0000 0000"            /* ...ù++++Éœœù.... */
	$"FFEC C0EC FF00 0000 0000 0000 0000 0000"            /* ùœøœù........... */
	$"0000 FF2B 2B2B 2BB0 ECFF B02B FF00 0000"            /* ..ù++++ÉœùÉ+ù... */
	$"FFC0 ECC0 FF00 0000 0000 0000 0000 0000"            /* ùøœøù........... */
	$"00FF 2B2B 2B2B ECEC ECEC 2B2B 00FF 0000"            /* .ù++++œœœœ++.ù.. */
	$"FFEC C0EC FF00 0000 0000 0000 0000 0000"            /* ùœøœù........... */
	$"FF2B 2B2B 2B2B F9B0 B0EC ECEC FF2B FF00"            /* ù+++++òÉÉœœœù+ù. */
	$"FFC0 ECC0 FF00 0000 0000 0000 0000 00FF"            /* ùøœøù..........ù */
	$"2B2B 2B2B 2BEC B0EC B0EC ECC0 2B2B 2BFF"            /* +++++œÉœÉœœø+++ù */
	$"FFEC C0EC FF00 0000 0000 0000 0000 FF2B"            /* ùœøœù.........ù+ */
	$"2B2B 2B2B 2BEC FCB0 B0B0 ECEC 2B2B 2B2B"            /* +++++œ∏ÉÉÉœœ++++ */
	$"FFC0 ECC0 FF00 0000 0000 0000 00FF 2B2B"            /* ùøœøù........ù++ */
	$"2B2B 2B2B 2BEC B0EC B0EC B0C0 2BFF FFFF"            /* +++++œÉœÉœÉø+ùùù */
	$"FFEC C0EC FFFF FFFF 0000 0000 FF2B 2B2B"            /* ùœøœùùùù....ù+++ */
	$"2B2B 2B2B 2BEC FCB0 B0EC B02B 2B2B FFC0"            /* +++++œ∏ÉÉœÉ+++ùø */
	$"ECC0 ECC0 ECC0 FF00 0000 00FF 2B2B 2B2B"            /* œøœøœøù....ù++++ */
	$"2B2B 2B2B 2BEC B0B0 B0EC B02B 2B2B 2BFF"            /* +++++œÉÉÉœÉ++++ù */
	$"C0EC C0EC C0FF 0000 0000 FF2B 2B2B 2B2B"            /* øœøœøù....ù+++++ */
	$"2B2B 2B2B C0EC EC00 B0B0 EC2B 2B2B 2B2B"            /* ++++øœœ.ÉÉœ+++++ */
	$"FFC0 ECC0 FF00 0000 00FF 2B2B 2B2B 2B2B"            /* ùøœøù....ù++++++ */
	$"2B2B 2B2B 2BF9 B0F9 B0EC C02B 2B2B 2B2B"            /* +++++òÉòÉœø+++++ */
	$"2BFF C0FF 2BFF 0000 FF2B 2B2B 2B2B 2B2B"            /* +ùøù+ù..ù+++++++ */
	$"2B2B 2B2B ECEC EC00 B0B0 EC2B 2B2B 2B2B"            /* ++++œœœ.ÉÉœ+++++ */
	$"2B2B FF2B 2B2B FF00 00FF 2B2B 2B2B 2B2B"            /* ++ù+++ù..ù++++++ */
	$"2B2B 2B2B ECEC B02B B0EC B02B 2B2B 2B2B"            /* ++++œœÉ+ÉœÉ+++++ */
	$"2B2B 2B2B 2B2B 2BFF 0000 FF2B 2B2B 2B2B"            /* +++++++ù..ù+++++ */
	$"2B2B 2B2B ECEC EC00 FCEC F92B 2B2B 2B2B"            /* ++++œœœ.∏œò+++++ */
	$"2B2B 2B2B 2B2B FF00 0000 00FF 2B2B 2B2B"            /* ++++++ù....ù++++ */
	$"2B2B 2B2B 2BEC B000 ECB0 EC2B 2B2B 2B2B"            /* +++++œÉ.œÉœ+++++ */
	$"2B2B 2B2B 2BFF 0000 0000 0000 FF2B 2B2B"            /* +++++ù......ù+++ */
	$"2B2B 2B2B 2BEC FC2B B0FC 2B2B 2B2B 2B2B"            /* +++++œ∏+É∏++++++ */
	$"2B2B 2B2B FF00 0000 0000 0000 00FF 2B2B"            /* ++++ù........ù++ */
	$"2B2B 2B2B 2BEC B000 B0EC EC2B 2B2B 2B2B"            /* +++++œÉ.Éœœ+++++ */
	$"2B2B 2BFF 0000 0000 0000 0000 0000 FF2B"            /* +++ù..........ù+ */
	$"2B2B 2B2B 2B2B B000 7FB0 2B2B 2B2B 2B2B"            /* ++++++É..É++++++ */
	$"2B2B FF00 0000 0000 0000 0000 0000 00FF"            /* ++ù............ù */
	$"2B2B 2B2B 2B2B B000 B0EC 2B2B 2B2B 2B2B"            /* ++++++É.Éœ++++++ */
	$"2BFF 0000 0000 0000 0000 0000 0000 0000"            /* +ù.............. */
	$"FF2B 2B2B 2B2B F900 B02B 2B2B 2B2B 2B2B"            /* ù+++++ò.É+++++++ */
	$"FF00 0000 0000 0000 0000 0000 0000 0000"            /* ù............... */
	$"00FF 2B2B 2B2B F900 F92B 2B2B 2B2B 2BFF"            /* .ù++++ò.ò++++++ù */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 FF2B 2B2B F900 F92B 2B2B 2B2B FF00"            /* ..ù+++ò.ò+++++ù. */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 00FF 2B2B F900 F92B 2B2B 2BFF 0000"            /* ...ù++ò.ò++++ù.. */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 FF2B 2B00 2B2B 2B2B FF00 0000"            /* ....ù++.++++ù... */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 00FF 2BF9 2B2B 2BFF 0000 0000"            /* .....ù+ò+++ù.... */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 FF2B 2B2B FF00 0000 0000"            /* ......ù+++ù..... */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 00FF 2BFF 0000 0000 0000"            /* .......ù+ù...... */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 0000 FF00 0000 0000 0000"            /* ........ù....... */
	$"0000 0000 0000 0000"                                /* ........ */
};
