/*
 * tclets.r --
 *
 */

/*
 * New style DLOG templates have an extra field for the positioning
 * options for the Dialog Box.  We will not use this, for now, so we
 * turn it off here.
 */
 
#define DLOG_RezTemplateVersion 0

#include <Types.r>
#include <SysTypes.r>
#include <AEUserTermTypes.r>

/* 
 * We now load the Tclets code into the resource fork
 */

#define TK_LIBRARY_RESOURCES 3000

read 'TEXT' (TK_LIBRARY_RESOURCES+114, "tclshrc", purgeable) 
	"::mac:tclets.tcl";

data 'icns' (-16455) {
	$"6963 6E73 0000 08F8 6963 7323 0000 0048"            /* icns...ψics#...H */
	$"0100 02EE 05CE 09EE 13DE 23FF 47CE 86C6"            /* ...ξ.ΞΖξ.ή#ÿGΞ†Ζ */
	$"4681 22C2 12C4 0888 0410 0220 0140 0080"            /* F"Β.Δ.... .@.€ */
	$"0100 03EE 07CE 0FEE 1FFE 3FFF 7FFE FFFE"            /* ...ξ.Ξ.ξ.ώ?ÿ.ώÿώ */
	$"7FFF 3FFE 1FFC 0FF8 07F0 03E0 01C0 0080"            /* .ÿ?ώ.ό.ψ.π.ΰ.ΐ.€ */
	$"6963 7334 0000 0088 0000 000F 0000 0000"            /* ics4........... */
	$"0000 00FC F6D0 FFF0 0000 0FC5 DD00 F6F0"            /* ...όφΠÿπ...Εέ.φπ */
	$"0000 FCCD 66F0 F6F0 000F CC6E 66CE F6F0"            /* ..όΝfπφπ..ΜnfΞφπ */
	$"00FC CC6E 67EF F6FF 0FCC CD66 66CC F6F0"            /* .όΜngοφÿ.ΜΝffΜφπ */
	$"FCCC CDDC 66CC CFA0 0FCC CD6C EDCC CC0F"            /* όΜΝάfΜΟ .ΜΝlνΜΜ. */
	$"00FC CC6C E6CC CCF0 000F CC6C 66CC CF00"            /* .όΜlζΜΜπ..ΜlfΜΟ. */
	$"0000 FCCC 6CCC F000 0000 0FCC DCCF 0000"            /* ..όΜlΜπ....ΜάΟ.. */
	$"0000 00FD DCF0 0000 0000 000F CF00 0000"            /* ...ύάπ......Ο... */
	$"0000 0000 F000 0000 6963 7338 0000 0108"            /* ....π...ics8.... */
	$"0000 0000 0000 00FF 0000 0000 0000 0000"            /* .......ÿ........ */
	$"0000 0000 0000 FF2B FFEC 7F00 FFFF FF00"            /* ......ÿ+ÿμ..ÿÿÿ. */
	$"0000 0000 00FF 2BB0 7F7F 0000 FFEC FF00"            /* .....ÿ+°....ÿμÿ. */
	$"0000 0000 FF2B 2B7F ECEC FF00 FFEC FF00"            /* ....ÿ++.μμÿ.ÿμÿ. */
	$"0000 00FF 2B2B ECFC ECEC 2BFB FFEC FF00"            /* ...ÿ++μόμμ+ϋÿμÿ. */
	$"0000 FF2B 2B2B ECFC ECC0 FBFF FFEC FFFF"            /* ..ÿ+++μόμΐϋÿÿμÿÿ */
	$"00FF 2B2B 2B7F ECEC ECEC 2B2B FFEC FF00"            /* .ÿ+++.μμμμ++ÿμÿ. */
	$"FF2B 2B2B 2B7F 7FF6 ECEC 2B2B 2BFF FD00"            /* ÿ++++..φμμ+++ÿύ. */
	$"00FF 2B2B 2B7F ECF6 FCF9 2B2B 2B2B 00FF"            /* .ÿ+++.μφόω++++.ÿ */
	$"0000 FF2B 2B2B ECF6 FCEC 2B2B 2B2B FF00"            /* ..ÿ+++μφόμ++++ÿ. */
	$"0000 00FF 2B2B ECF6 ECEC 2B2B 2BFF 0000"            /* ...ÿ++μφμμ+++ÿ.. */
	$"0000 0000 FF2B 2BF6 EC2B 2B2B FF00 0000"            /* ....ÿ++φμ+++ÿ... */
	$"0000 0000 00FF 2BF6 F92B 2BFF 0000 0000"            /* .....ÿ+φω++ÿ.... */
	$"0000 0000 0000 FFF9 F92B FF00 0000 0000"            /* ......ÿωω+ÿ..... */
	$"0000 0000 0000 00FF 2BFF 0000 0000 0000"            /* .......ÿ+ÿ...... */
	$"0000 0000 0000 0000 FF00 0000 0000 0000"            /* ........ÿ....... */
	$"4943 4E23 0000 0108 0001 0000 0002 8000"            /* ICN#..........€. */
	$"0004 78F8 0008 70F8 0010 F0F8 0021 E8F8"            /* ..xψ..pψ..πψ.!θψ */
	$"0043 C4F8 0081 FAF8 0107 F1F8 0207 F0F8"            /* .CΔψ.ϊψ..ρψ..πψ */
	$"0407 F7FF 0807 E3FE 1007 E1FC 200E E0F8"            /* ..χÿ..γώ..αό .ΰψ */
	$"4002 E074 800E E022 400E E001 200E C002"            /* @.ΰt€.ΰ"@.ΰ. .ΐ. */
	$"1006 E004 0806 C008 0406 E010 0202 C020"            /* ..ΰ...ΐ...ΰ...ΐ  */
	$"0102 C040 0080 8080 0040 0100 0020 0200"            /* ..ΐ@.€€€.@... .. */
	$"0010 0400 0008 0800 0004 1000 0002 2000"            /* .............. . */
	$"0001 4000 0000 8000 0001 0000 0003 8000"            /* ..@...€.......€. */
	$"0007 F8F8 000F F0F8 001F F0F8 003F F8F8"            /* ..ψψ..πψ..πψ.?ψψ */
	$"007F FCF8 00FF FEF8 01FF FFF8 03FF FFF8"            /* ..όψ.ÿώψ.ÿÿψ.ÿÿψ */
	$"07FF FFFF 0FFF FFFE 1FFF FFFC 3FFF FFF8"            /* .ÿÿÿ.ÿÿώ.ÿÿό?ÿÿψ */
	$"7FFF FFFC FFFF FFFE 7FFF FFFF 3FFF FFFE"            /* .ÿÿόÿÿÿώ.ÿÿÿ?ÿÿώ */
	$"1FFF FFFC 0FFF FFF8 07FF FFF0 03FF FFE0"            /* .ÿÿό.ÿÿψ.ÿÿπ.ÿÿΰ */
	$"01FF FFC0 00FF FF80 007F FF00 003F FE00"            /* .ÿÿΐ.ÿÿ€..ÿ..?ώ. */
	$"001F FC00 000F F800 0007 F000 0003 E000"            /* ..ό...ψ...π...ΰ. */
	$"0001 C000 0000 8000 6963 6C34 0000 0208"            /* ..ΐ...€.icl4.... */
	$"0000 0000 0000 000F 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 00FC F000 0000 0000 0000"            /* .......όπ....... */
	$"0000 0000 0000 0FCC CFD6 D000 FFFF F000"            /* .......ΜΟΦΠ.ÿÿπ. */
	$"0000 0000 0000 FCCC C556 0000 F767 F000"            /* ......όΜΕV..χgπ. */
	$"0000 0000 000F CCCC 566F 0000 F676 F000"            /* ......ΜΜVo..φvπ. */
	$"0000 0000 00FC CCC5 6F5C F000 F767 F000"            /* .....όΜΕo\π.χgπ. */
	$"0000 0000 0FCC CC66 66CC 0F00 F676 F000"            /* .....ΜΜffΜ..φvπ. */
	$"0000 0000 FCCC CCD5 5666 FCF0 F767 F000"            /* ....όΜΜΥVfόπχgπ. */
	$"0000 000F CCCC C656 5667 CCCF F676 F000"            /* ....ΜΜΖVVgΜΟφvπ. */
	$"0000 00FC CCCC C6E5 5566 CCCC F767 F000"            /* ...όΜΜΖεUfΜΜχgπ. */
	$"0000 0FCC CCCC C656 5657 CFFF F676 FFFF"            /* ...ΜΜΜΖVVWΟÿφvÿÿ */
	$"0000 FCCC CCCC C6E5 565C CCF7 6767 67F0"            /* ..όΜΜΜΖεV\Μχgggπ */
	$"000F CCCC CCCC C655 565C CCCF 7676 7F00"            /* ..ΜΜΜΜΖUV\ΜΟvv.. */
	$"00FC CCCC CCCC 7660 556C CCCC F767 F000"            /* .όΜΜΜΜv`UlΜΜχgπ. */
	$"0FCC CCCC CCCC CD5D 567C CCCC CF7F CF00"            /* .ΜΜΜΜΜΝ]V|ΜΜΟ.Ο. */
	$"FCCC CCCC CCCC 6660 556C CCCC CCFC CCF0"            /* όΜΜΜΜΜf`UlΜΜΜόΜπ */
	$"0FCC CCCC CCCC 665C 565C CCCC CCCC CCCF"            /* .ΜΜΜΜΜf\V\ΜΜΜΜΜΟ */
	$"00FC CCCC CCCC 6660 E6DC CCCC CCCC CCF0"            /* .όΜΜΜΜf`ζάΜΜΜΜΜπ */
	$"000F CCCC CCCC C650 656C CCCC CCCC CF00"            /* ..ΜΜΜΜΖPelΜΜΜΜΟ. */
	$"0000 FCCC CCCC C6EC 5ECC CCCC CCCC F000"            /* ..όΜΜΜΖμ^ΜΜΜΜΜπ. */
	$"0000 0FCC CCCC C650 566C CCCC CCCF 0000"            /* ...ΜΜΜΖPVlΜΜΜΟ.. */
	$"0000 00FC CCCC CC50 D5CC CCCC CCF0 0000"            /* ...όΜΜΜPΥΜΜΜΜπ.. */
	$"0000 000F CCCC CC50 56CC CCCC CF00 0000"            /* ....ΜΜΜPVΜΜΜΟ... */
	$"0000 0000 FCCC CCD0 5CCC CCCC F000 0000"            /* ....όΜΜΠ\ΜΜΜπ... */
	$"0000 0000 0FCC CCD0 DCCC CCCF 0000 0000"            /* .....ΜΜΠάΜΜΟ.... */
	$"0000 0000 00FC CCD0 DCCC CCF0 0000 0000"            /* .....όΜΠάΜΜπ.... */
	$"0000 0000 000F CCD0 DCCC CF00 0000 0000"            /* ......ΜΠάΜΟ..... */
	$"0000 0000 0000 FCC0 CCCC F000 0000 0000"            /* ......όΐΜΜπ..... */
	$"0000 0000 0000 0FCD CCCF 0000 0000 0000"            /* .......ΝΜΟ...... */
	$"0000 0000 0000 00FC CCF0 0000 0000 0000"            /* .......όΜπ...... */
	$"0000 0000 0000 000F CF00 0000 0000 0000"            /* ........Ο....... */
	$"0000 0000 0000 0000 F000 0000 0000 0000"            /* ........π....... */
	$"6963 6C38 0000 0408 0000 0000 0000 0000"            /* icl8............ */
	$"0000 0000 0000 00FF 0000 0000 0000 0000"            /* .......ÿ........ */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 FF2B FF00 0000 0000 0000"            /* ......ÿ+ÿ....... */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 00FF 2B2B 2BFF 7FEC 7F00 0000"            /* .....ÿ+++ÿ.μ.... */
	$"FFFF FFFF FF00 0000 0000 0000 0000 0000"            /* ÿÿÿÿÿ........... */
	$"0000 0000 FF2B 2B2B 2BB0 B0EC 0000 0000"            /* ....ÿ++++°°μ.... */
	$"FFC0 ECC0 FF00 0000 0000 0000 0000 0000"            /* ÿΐμΐÿ........... */
	$"0000 00FF 2B2B 2B2B B0EC ECFF 0000 0000"            /* ...ÿ++++°μμÿ.... */
	$"FFEC C0EC FF00 0000 0000 0000 0000 0000"            /* ÿμΐμÿ........... */
	$"0000 FF2B 2B2B 2BB0 ECFF B02B FF00 0000"            /* ..ÿ++++°μÿ°+ÿ... */
	$"FFC0 ECC0 FF00 0000 0000 0000 0000 0000"            /* ÿΐμΐÿ........... */
	$"00FF 2B2B 2B2B ECEC ECEC 2B2B 00FF 0000"            /* .ÿ++++μμμμ++.ÿ.. */
	$"FFEC C0EC FF00 0000 0000 0000 0000 0000"            /* ÿμΐμÿ........... */
	$"FF2B 2B2B 2B2B F9B0 B0EC ECEC FF2B FF00"            /* ÿ+++++ω°°μμμÿ+ÿ. */
	$"FFC0 ECC0 FF00 0000 0000 0000 0000 00FF"            /* ÿΐμΐÿ..........ÿ */
	$"2B2B 2B2B 2BEC B0EC B0EC ECC0 2B2B 2BFF"            /* +++++μ°μ°μμΐ+++ÿ */
	$"FFEC C0EC FF00 0000 0000 0000 0000 FF2B"            /* ÿμΐμÿ.........ÿ+ */
	$"2B2B 2B2B 2BEC FCB0 B0B0 ECEC 2B2B 2B2B"            /* +++++μό°°°μμ++++ */
	$"FFC0 ECC0 FF00 0000 0000 0000 00FF 2B2B"            /* ÿΐμΐÿ........ÿ++ */
	$"2B2B 2B2B 2BEC B0EC B0EC B0C0 2BFF FFFF"            /* +++++μ°μ°μ°ΐ+ÿÿÿ */
	$"FFEC C0EC FFFF FFFF 0000 0000 FF2B 2B2B"            /* ÿμΐμÿÿÿÿ....ÿ+++ */
	$"2B2B 2B2B 2BEC FCB0 B0EC B02B 2B2B FFC0"            /* +++++μό°°μ°+++ÿΐ */
	$"ECC0 ECC0 ECC0 FF00 0000 00FF 2B2B 2B2B"            /* μΐμΐμΐÿ....ÿ++++ */
	$"2B2B 2B2B 2BEC B0B0 B0EC B02B 2B2B 2BFF"            /* +++++μ°°°μ°++++ÿ */
	$"C0EC C0EC C0FF 0000 0000 FF2B 2B2B 2B2B"            /* ΐμΐμΐÿ....ÿ+++++ */
	$"2B2B 2B2B C0EC EC00 B0B0 EC2B 2B2B 2B2B"            /* ++++ΐμμ.°°μ+++++ */
	$"FFC0 ECC0 FF00 0000 00FF 2B2B 2B2B 2B2B"            /* ÿΐμΐÿ....ÿ++++++ */
	$"2B2B 2B2B 2BF9 B0F9 B0EC C02B 2B2B 2B2B"            /* +++++ω°ω°μΐ+++++ */
	$"2BFF C0FF 2BFF 0000 FF2B 2B2B 2B2B 2B2B"            /* +ÿΐÿ+ÿ..ÿ+++++++ */
	$"2B2B 2B2B ECEC EC00 B0B0 EC2B 2B2B 2B2B"            /* ++++μμμ.°°μ+++++ */
	$"2B2B FF2B 2B2B FF00 00FF 2B2B 2B2B 2B2B"            /* ++ÿ+++ÿ..ÿ++++++ */
	$"2B2B 2B2B ECEC B02B B0EC B02B 2B2B 2B2B"            /* ++++μμ°+°μ°+++++ */
	$"2B2B 2B2B 2B2B 2BFF 0000 FF2B 2B2B 2B2B"            /* +++++++ÿ..ÿ+++++ */
	$"2B2B 2B2B ECEC EC00 FCEC F92B 2B2B 2B2B"            /* ++++μμμ.όμω+++++ */
	$"2B2B 2B2B 2B2B FF00 0000 00FF 2B2B 2B2B"            /* ++++++ÿ....ÿ++++ */
	$"2B2B 2B2B 2BEC B000 ECB0 EC2B 2B2B 2B2B"            /* +++++μ°.μ°μ+++++ */
	$"2B2B 2B2B 2BFF 0000 0000 0000 FF2B 2B2B"            /* +++++ÿ......ÿ+++ */
	$"2B2B 2B2B 2BEC FC2B B0FC 2B2B 2B2B 2B2B"            /* +++++μό+°ό++++++ */
	$"2B2B 2B2B FF00 0000 0000 0000 00FF 2B2B"            /* ++++ÿ........ÿ++ */
	$"2B2B 2B2B 2BEC B000 B0EC EC2B 2B2B 2B2B"            /* +++++μ°.°μμ+++++ */
	$"2B2B 2BFF 0000 0000 0000 0000 0000 FF2B"            /* +++ÿ..........ÿ+ */
	$"2B2B 2B2B 2B2B B000 7FB0 2B2B 2B2B 2B2B"            /* ++++++°..°++++++ */
	$"2B2B FF00 0000 0000 0000 0000 0000 00FF"            /* ++ÿ............ÿ */
	$"2B2B 2B2B 2B2B B000 B0EC 2B2B 2B2B 2B2B"            /* ++++++°.°μ++++++ */
	$"2BFF 0000 0000 0000 0000 0000 0000 0000"            /* +ÿ.............. */
	$"FF2B 2B2B 2B2B F900 B02B 2B2B 2B2B 2B2B"            /* ÿ+++++ω.°+++++++ */
	$"FF00 0000 0000 0000 0000 0000 0000 0000"            /* ÿ............... */
	$"00FF 2B2B 2B2B F900 F92B 2B2B 2B2B 2BFF"            /* .ÿ++++ω.ω++++++ÿ */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 FF2B 2B2B F900 F92B 2B2B 2B2B FF00"            /* ..ÿ+++ω.ω+++++ÿ. */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 00FF 2B2B F900 F92B 2B2B 2BFF 0000"            /* ...ÿ++ω.ω++++ÿ.. */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 FF2B 2B00 2B2B 2B2B FF00 0000"            /* ....ÿ++.++++ÿ... */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 00FF 2BF9 2B2B 2BFF 0000 0000"            /* .....ÿ+ω+++ÿ.... */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 FF2B 2B2B FF00 0000 0000"            /* ......ÿ+++ÿ..... */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 00FF 2BFF 0000 0000 0000"            /* .......ÿ+ÿ...... */
	$"0000 0000 0000 0000 0000 0000 0000 0000"            /* ................ */
	$"0000 0000 0000 0000 FF00 0000 0000 0000"            /* ........ÿ....... */
	$"0000 0000 0000 0000"                                /* ........ */
};
